//
//  RevisionResult.swift
//  HAIs-Checklist
//
//  Created by Valeriia Yevtushenko on 10.04.2023.
//

import Foundation

enum RevisionResult {
    case success
    case failure
    case none
    
    func getRecommendation() -> String {
        let text = """
        1. Провести засідання Комісії з інфекційного контролю та скласти План дій з покращення гігієни рук із врахуванням місцевого контексту.
        2. Ініціювати для затвердження керівництвом ЗОЗ цей План дій з покращення гігієни рук із врахуванням місцевого контексту.
        3. Лікарю-епідеміологу з відділу ПІІК координувати реалізацію Плану дій з покращення гігієни рук на всіх етапах.
        4. Навчання працівників ЗОЗ питанням:
        - основи інфекційної безпеки пацієнтів;
        -  визначення, вплив та розповсюдженість інфекцій, пов’язаних з наданням медичної допомоги (ІПНМД);
        -  основні патерни передавання патогенів, що пов’язані із наданням медичної допомоги, із акцентуацією уваги на контактному (через руки) шляху інфікування;
        -  профілактика ІПНМД і роль гігієни рук в ній;
        -  правила і практики з гігієни рук;

        5. Підготовка додаткових навчальних матеріалів із включенням даних звітів за результатами проведених оцінок.
        6. Підготовка інформаційних матеріалів (стенди, плакати, листівки тощо) з гігієни рук.
        7. Організація регулярних зустрічей для моніторингу реалізації заходів, обговорення поточної ситуації та корекції плану дій з гігієни рук при необхідності.
        """
        
        switch self {
        case.failure:
            return text
        default:
            return ""
        }
    }
}
